Autodesk.Revit.DB.NumberSystem.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.Architecture.StairsNumberSystemReferenceOption,Autodesk.Revit.DB.LinkElementId)
Creates a new instance of a NumberSystem associated to a host element, a view, and a reference level of stairs if in a multistory stairs.
Remarks:
In multistory stairs, a stairs element could be a stair group or individual stair.
This method allows to add a NumberSystem for a run of an individual stairs or a stairs group member on the placementLevelId.
document:
The document.
viewId:
The view in which the NumberSystem will be created.
hostElementId:
The host id on which the NumberSystem will be created.
referenceOption:
The reference option of the NumberSystem.
placementLevelId:
The id of the level on which the NumberSystem will be placed. The placement level must be one of the base levels of a stairs group members. It is suggested to
get the level from MultistoryStairs.GetStairsPlacementLevels().
Returns:
The created NumberSystem.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not valid for placement of a NumberSystem (only floor plan views and elevation views are permitted).
-or-
hostElementId is not valid as a host for NumberSystem (only StairsRun elements are permitted in this release).
-or-
The reference option is not valid for a NumberSystem.
-or-
The placementLevelId is not one of the stairs base levels.
-or-
The hostElementId already has a number system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018

Autodesk.Revit.DB.NumberSystem.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.Reference)
Creates a new instance of a NumberSystem associated to a host element and a view.
document:
The document.
viewId:
The view in which the NumberSystem will be created.
numberedElementId:
The host id on which the NumberSystem will be created.
referenceCurve:
The reference curve along which the NumberSystem will be created. It is suggested to get the new reference via GetNumberSystemReference() from the host element.
Returns:
The created NumberSystem.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not valid for placement of a NumberSystem (only floor plan views and elevation views are permitted).
-or-
numberedElementId is not valid as a host for NumberSystem (only StairsRun elements are permitted in this release).
-or-
The referenceCurve is not valid for NumberSystem on numberedElementId.
-or-
The numberedElementId already has a NumberSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.NumberSystem.SetReferencePick(Autodesk.Revit.DB.Reference)
Sets the reference pick.
Remarks:
It is suggested to get the new reference via GetNumberSystemReference() from the host element.
referencePick:
The pick to set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The referencePick is not a valid reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.NumberSystem.GetReferencePick
Gets the reference curve.
Returns:
The pick of reference curve.
Since:
2013

Autodesk.Revit.DB.NumberSystem.JustifyOption
The number justify option of number system.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.NumberSystem.NumberOrientation
The number orientation of number system.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.NumberSystem.NumberDisplayRule
The display rule of the number system.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.NumberSystem.NumberedElementId
The LinkElementId of the numbered host element.
Since:
2013

Autodesk.Revit.DB.NumberSystem.PlacementLevelId
The id of the base level of stairs on which the NumberSystem is placed.
Remarks:
In multistory stairs, a stairs element could be a stair group or individual stair, this level could be the base level of group member or stairs element.
Since:
2018

Autodesk.Revit.DB.NumberSystem.JustifyOffset
The offset to the justification curve.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for justifyOffset must be no more than 30000 feet in absolute value.
Since:
2013

Autodesk.Revit.DB.NumberSystem.ReferenceOffset
The offset to the reference curve.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for referenceOffset must be no more than 30000 feet in absolute value.
Since:
2013

Autodesk.Revit.DB.NumberSystem
An annotation that consists of a series of numeric tags attached to and describing a host element.
Remarks:
For a component-based stair, you can display tread/riser numbers for a run in plan, elevation, or section view. Sketch-based stair is not supported.
Since:
2013